docs: add and rewrite README.md
